{
  "projects": [
    {
      "title": "Grasshopper",
      "image": "dist/assets/img/grasshopper.png",
      "url": "https://play.google.com/store/apps/details?id=com.area120.grasshopper&hl=en",
      "year": [2016, 2018],
      "description": ["Grasshopper is an Area120 product I co-founded. It's a React-Native mobile app that teaches you how to code by composing real JavaScript, without needing to worry about syntax. It's aimed at beginners and career changers.", "We are currently deployed on Android, and coming soon to iOS."]
    },
    {
      "title": "Ayasdi Core",
      "image": "dist/assets/img/core.jpg",
      "url": "https://core.ayasdi.com",
      "years": [2013, 2015],
      "description": ["Ayasdi Core is what I spend most of time working on as a frontend engineer for Ayasdi.", "Core is the first of several applications Ayasdi is building to help industries explore large, complex data sets with digestible visualizations. It is built with minimal dependencies (Backbone, D3, ), and with a design framework we have created that extends across all of our applications."]
    },
    {
      "title": "Strummify",
      "image": "dist/assets/img/strummify.jpg",
      "url": "http://www.strummify.com/",
      "years": [2012, 2013],
      "description": ["Strummify is a web application for learning guitar. I taught myself how to code using sites like Udacity & Codeacademy, and figured that the same approach could be taken for musical instruments. The goal was to provide real time, interactive feedback on your guitar playing. Employing the help of some friends, we created a prototype that included polyphonic pitch detection and a simple user interface.", "Unfortunately, Strummify has not had much love and support since I finished my Masters program at Stanford. The pitch detection needs significant improvement and the backend, created somewhat hastily towards the end of the quarter, is in need of repairs."]
    },
    {
      "title": "Visualizing New York Hospital Data",
      "image": "dist/assets/img/nyhealth.jpg",
      "url": "http://thebeautyofhealthdata.org/?p=348",
      "years": [2014],
      "description": ["This static visualization (click above for complete image) was created for the Beauty of Health Data contest that took place in Summer of 2014. My entry won the category for Best Data Exploration."]
    },
    {
      "title": "Climate Change Comes Home",
      "image": "dist/assets/img/climate.jpg",
      "url": "http://climatechange.herokuapp.com/",
      "years": [2014],
      "description": ["This article was a small side project designed & hosted for the Stanford Peninsula Press."]
    },
    {
      "title": "Twitter Activity & Hurricane Sandy",
      "image": "dist/assets/img/sandy.jpg",
      "url": "http://bl.ocks.org/dannycochran/raw/5689222/",
      "years": [2013],
      "description": ["This data visualization was my final project for CS448B: Data Visualization. Myself and three other students wanted to reimagine text visualizations, which mostly consist of word clouds today.", "By providing context on the sentiment of the word and its frequency over time, we hoped to let people dig deeper into text analysis."]
    },
    {
      "title": "Costs of Living",
      "image": "dist/assets/img/costs.jpg",
      "url": "http://bl.ocks.org/dannycochran/raw/4349896/",
      "description": ["My first endeavor with creating a D3.js visualization, I can still remember agonizing over what, at the time, seemed like an obscure and unintelligble D3 api."],
      "year": [2013]
    },
    {
      "title": "Disgo",
      "image": "dist/assets/img/disgo.jpg",
      "url": "",
      "years": [2012],
      "description": ["Disgo was a jQuery-mobile application I built with two other students for CS147: Human Computer Interaction. Our goal was to create an application where people started conversations regarding specific places of interest.", "At its peak, Disgo had upwards of 20 users. Unfortunately, Stanford discontinued my personal student directory once I graduated, and Disgo is now disgone."]
    },
    {
      "title": "Yogiplay UX & UI",
      "image": "dist/assets/img/yogiplay.jpg",
      "url": "http://yogiplay.com/",
      "years": [2012],
      "description": ["Yogiplay was a mobile app startup designed to help parents pick quality educational applications for their kids.", "We had a common, but still unsolved challenge in that we wanted to target all mobile devices using HTML5. This was my first introduction to responsive design, and as I was purely on the design side of this project (and not on engineering), I now sympathize greatly with the <a href='http://www.marcosiglesias.com/home'>sole frontend engineer</a> on the project."]
    }
  ]
}